"An error occurred. Please try again." = "Προέκυψε σφάλμα. Δοκιμάστε ξανά.";

"Card brand was not updated. Please try again." = "Η επωνυμία κάρτας δεν ενημερώθηκε. Δοκιμάστε ξανά.";

"Close" = "Κλείσιμο";

"Default payment method was not updated. Please try again." = "Η προεπιλεγμένη μέθοδος πληρωμής δεν ενημερώθηκε. Δοκιμάστε ξανά.";

"Scan Card" = "Σάρωση κάρτας";

"Scan card" = "Σάρωση κάρτας";

"The IBAN you entered is invalid." = "Ο κωδικός IBAN που εισαγάγατε δεν είναι έγκυρος.";

"There was an error processing your card -- try again in a few seconds" = "Προέκυψε απροσδόκητο σφάλμα κατά την επεξεργασία της κάρτας σας -- δοκιμάστε ξανά σε μερικά δευτερόλεπτα";

"There was an unexpected error -- try again in a few seconds" = "Προέκυψε απροσδόκητο σφάλμα -- δοκιμάστε ξανά σε μερικά δευτερόλεπτα";

"Try again" = "Δοκιμάστε ξανά";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Χρησιμοποιούμε τη Stripe για να επαληθεύσουμε τα στοιχεία της κάρτας σας. Η Stripe μπορεί να χρησιμοποιεί και να αποθηκεύει τα δεδομένα σας σύμφωνα με την πολιτική απορρήτου της. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Μάθετε περισσότερα</u></a>";

"Your card has expired" = "Η κάρτα σας έχει λήξει";

"Your card was declined" = "Η κάρτα σας απορρίφθηκε";

"Your card's expiration month is invalid" = "Ο μήνας λήξης της κάρτας σας δεν είναι έγκυρος";

"Your card's expiration year is invalid" = "Το έτος λήξης της κάρτας σας δεν είναι έγκυρο";

"Your card's number is invalid" = "Ο αριθμός της κάρτας σας δεν είναι έγκυρος";

"Your card's security code is invalid" = "Ο κωδικός ασφαλείας της κάρτας σας δεν είναι έγκυρος";

"Your name is invalid." = "Το όνομά σας δεν είναι έγκυρο.";

"Your payment method was declined." = "Η μέθοδος πληρωμής σας απορρίφθηκε.";
